zephyrproject-rtos/hal_gigadevice/include/dt-bindings/pinctrl/gd32f407r(e-g-k)xx-pinctrl.h
/* ENET_MII_RXD2 */
#define ENET_MII_RXD2_PB0 \
	GD32_PINMUX_AF('B', 0, AF11)

/* ENET_MII_RXD3 */
#define ENET_MII_RXD3_PB1 \
	GD32_PINMUX_AF('B', 1, AF11)

/* ENET_MII_RX_CLK */
#define ENET_MII_RX_CLK_PA1 \
	GD32_PINMUX_AF('A', 1, AF11)

/* ENET_MII_RX_DV */
#define ENET_MII_RX_DV_PA7 \
	GD32_PINMUX_AF('A', 7, AF11)

/* ENET_MII_RX_ER */
#define ENET_MII_RX_ER_PB9 \
	GD32_PINMUX_AF('B', 9, AF1)

/* ENET_MII_TXD0 */
#define ENET_MII_TXD0_PB11 \
	GD32_PINMUX_AF('B', 11, AF11)

/* ENET_MII_TXD1 */
#define ENET_MII_TXD1_PB12 \
	GD32_PINMUX_AF('B', 12, AF11)

/* ENET_MII_TXD2 */
#define ENET_MII_TXD2_PC2 \
	GD32_PINMUX_AF('C', 2, AF11)

/* ENET_MII_TXD3 */
#define ENET_MII_TXD3_PB8 \
	GD32_PINMUX_AF('B', 8, AF11)

/* ENET_MII_TX_CLK */
#define ENET_MII_TX_CLK_PC3 \
	GD32_PINMUX_AF('C', 3, AF11)

/* ENET_MII_TX_EN */
#define ENET_MII_TX_EN_PB10 \
	GD32_PINMUX_AF('B', 10, AF11)

/* ENET_PPS_OUT */
#define ENET_PPS_OUT_PB5 \
	GD32_PINMUX_AF('B', 5, AF11)

/* ENET_RMII_CRS_DV */
#define ENET_RMII_CRS_DV_PA7 \
	GD32_PINMUX_AF('A', 7, AF11)

/* ENET_RMII_REF_CLK */
#define ENET_RMII_REF_CLK_PA1 \
	GD32_PINMUX_AF('A', 1, AF11)

/* ENET_RMII_RXD0 */
#define ENET_RMII_RXD0_PC4 \
	GD32_PINMUX_AF('C', 4, AF11)

/* ENET_RMII_RXD1 */
#define ENET_RMII_RXD1_PC5 \
	GD32_PINMUX_AF('C', 5, AF11)

/* ENET_RMII_TXD0 */
#define ENET_RMII_TXD0_PB11 \
	GD32_PINMUX_AF('B', 11, AF11)

/* ENET_RMII_TXD1 */
#define ENET_RMII_TXD1_PB12 \
	GD32_PINMUX_AF('B', 12, AF11)

/* ENET_RMII_TX_EN */
#define ENET_RMII_TX_EN_PB10 \
	GD32_PINMUX_AF('B', 10, AF11)

/* EVENTOUT */
#define EVENTOUT_PA0 \
	GD32_PINMUX_AF('A', 0, AF15)
#define EVENTOUT_PA1 \
	GD32_PINMUX_AF('A', 1, AF15)
#define EVENTOUT_PA2 \
	GD32_PINMUX_AF('A', 2, AF15)
#define EVENTOUT_PA3 \
	GD32_PINMUX_AF('A', 3, AF15)
#define EVENTOUT_PA4 \
	GD32_PINMUX_AF('A', 4, AF15)
#define EVENTOUT_PA5 \
	GD32_PINMUX_AF('A', 5, AF15)
#define EVENTOUT_PA6 \
	GD32_PINMUX_AF('A', 6, AF15)
#define EVENTOUT_PA7 \
	GD32_PINMUX_AF('A', 7, AF15)
#define EVENTOUT_PA8 \
	GD32_PINMUX_AF('A', 8, AF15)
#define EVENTOUT_PA9 \
	GD32_PINMUX_AF('A', 9, AF15)
#define EVENTOUT_PA10 \
	GD32_PINMUX_AF('A', 10, AF15)
#define EVENTOUT_PA11 \
	GD32_PINMUX_AF('A', 11, AF15)
#define EVENTOUT_PA12 \
	GD32_PINMUX_AF('A', 12, AF15)
#define EVENTOUT_PA13 \
	GD32_PINMUX_AF('A', 13, AF15)
#define EVENTOUT_PA14 \
	GD32_PINMUX_AF('A', 14, AF15)
#define EVENTOUT_PA15 \
	GD32_PINMUX_AF('A', 15, AF15)
#define EVENTOUT_PB0 \
	GD32_PINMUX_AF('B', 0, AF15)
#define EVENTOUT_PB1 \
	GD32_PINMUX_AF('B', 1, AF15)
#define EVENTOUT_PB2 \
	GD32_PINMUX_AF('B', 2, AF15)
#define EVENTOUT_PB3 \
	GD32_PINMUX_AF('B', 3, AF15)
#define EVENTOUT_PB4 \
	GD32_PINMUX_AF('B', 4, AF15)
#define EVENTOUT_PB5 \
	GD32_PINMUX_AF('B', 5, AF15)
#define EVENTOUT_PB6 \
	GD32_PINMUX_AF('B', 6, AF15)
#define EVENTOUT_PB7 \
	GD32_PINMUX_AF('B', 7, AF15)
#define EVENTOUT_PB8 \
	GD32_PINMUX_AF('B', 8, AF15)
#define EVENTOUT_PB9 \
	GD32_PINMUX_AF('B', 9, AF15)
#define EVENTOUT_PB10 \
	GD32_PINMUX_AF('B', 10, AF15)
#define EVENTOUT_PB11 \
	GD32_PINMUX_AF('B', 11, AF15)
#define EVENTOUT_PB12 \
	GD32_PINMUX_AF('B', 12, AF15)
#define EVENTOUT_PB13 \
	GD32_PINMUX_AF('B', 13, AF15)
#define EVENTOUT_PB14 \
	GD32_PINMUX_AF('B', 14, AF15)
#define EVENTOUT_PB15 \
	GD32_PINMUX_AF('B', 15, AF15)
#define EVENTOUT_PC0 \
	GD32_PINMUX_AF('C', 0, AF15)
#define EVENTOUT_PC1 \
	GD32_PINMUX_AF('C', 1, AF15)
#define EVENTOUT_PC2 \
	GD32_PINMUX_AF('C', 2, AF15)
#define EVENTOUT_PC3 \
	GD32_PINMUX_AF('C', 3, AF15)
#define EVENTOUT_PC4 \
	GD32_PINMUX_AF('C', 4, AF15)
#define EVENTOUT_PC5 \
	GD32_PINMUX_AF('C', 5, AF15)
#define EVENTOUT_PC6 \
	GD32_PINMUX_AF('C', 6, AF15)
#define EVENTOUT_PC7 \
	GD32_PINMUX_AF('C', 7, AF15)
#define EVENTOUT_PC8 \
	GD32_PINMUX_AF('C', 8, AF15)
#define EVENTOUT_PC9 \
	GD32_PINMUX_AF('C', 9, AF15)
#define EVENTOUT_PC10 \
	GD32_PINMUX_AF('C', 10, AF15)
#define EVENTOUT_PC11 \
	GD32_PINMUX_AF('C', 11, AF15)
#define EVENTOUT_PC12 \
	GD32_PINMUX_AF('C', 12, AF15)
#define EVENTOUT_PC13 \
	GD32_PINMUX_AF('C', 13, AF15)
#define EVENTOUT_PC14 \
	GD32_PINMUX_AF('C', 14, AF15)
#define EVENTOUT_PC15 \
	GD32_PINMUX_AF('C', 15, AF15)
#define EVENTOUT_PD2 \
	GD32_PINMUX_AF('D', 2, AF15)

/* EXMC_NADV */
#define EXMC_NADV_PB7 \
	GD32_PINMUX_AF('B', 7, AF12)

/* EXMC_NL */
#define EXMC_NL_PB7 \
	GD32_PINMUX_AF('B', 7, AF12)

/* EXMC_SDCKE0 */
#define EXMC_SDCKE0_PC3 \
	GD32_PINMUX_AF('C', 3, AF12)
#define EXMC_SDCKE0_PC5 \
	GD32_PINMUX_AF('C', 5, AF12)

/* EXMC_SDCKE1 */
#define EXMC_SDCKE1_PB5 \
	GD32_PINMUX_AF('B', 5, AF12)

/* EXMC_SDNE0 */
#define EXMC_SDNE0_PC2 \
	GD32_PINMUX_AF('C', 2, AF12)
#define EXMC_SDNE0_PC4 \
	GD32_PINMUX_AF('C', 4, AF12)

/* EXMC_SDNE1 */
#define EXMC_SDNE1_PB6 \
	GD32_PINMUX_AF('B', 6, AF11)

/* EXMC_SDNWE */
#define EXMC_SDNWE_PC0 \
	GD32_PINMUX_AF('C', 0, AF12)

/* EXMC_SD_NWE */
#define EXMC_SD_NWE_PA7 \
	GD32_PINMUX_AF('A', 7, AF12)

/* I2C0_SCL */
#define I2C0_SCL_PB6 \
	GD32_PINMUX_AF('B', 6, AF4)
#define I2C0_SCL_PB8 \
	GD32_PINMUX_AF('B', 8, AF4)

/* I2C0_SDA */
#define I2C0_SDA_PB7 \
	GD32_PINMUX_AF('B', 7, AF4)
#define I2C0_SDA_PB9 \
	GD32_PINMUX_AF('B', 9, AF4)

/* I2C0_SMBA */
#define I2C0_SMBA_PB5 \
	GD32_PINMUX_AF('B', 5, AF4)

/* I2C0_TXFRAME */
#define I2C0_TXFRAME_PB4 \
	GD32_PINMUX_AF('B', 4, AF4)

/* I2C1_SCL */
#define I2C1_SCL_PB10 \
	GD32_PINMUX_AF('B', 10, AF4)

/* I2C1_SDA */
#define I2C1_SDA_PB3 \
	GD32_PINMUX_AF('B', 3, AF9)
#define I2C1_SDA_PB11 \
	GD32_PINMUX_AF('B', 11, AF4)
#define I2C1_SDA_PC12 \
	GD32_PINMUX_AF('C', 12, AF4)

/* I2C1_SMBA */
#define I2C1_SMBA_PB12 \
	GD32_PINMUX_AF('B', 12, AF4)

/* I2C1_TXFRAME */
#define I2C1_TXFRAME_PB13 \
	GD32_PINMUX_AF('B', 13, AF4)

/* I2C2_SCL */
#define I2C2_SCL_PA8 \
	GD32_PINMUX_AF('A', 8, AF4)

/* I2C2_SDA */
#define I2C2_SDA_PB4 \
	GD32_PINMUX_AF('B', 4, AF9)
#define I2C2_SDA_PC9 \
	GD32_PINMUX_AF('C', 9, AF4)

/* I2C2_SMBA */
#define I2C2_SMBA_PA9 \
	GD32_PINMUX_AF('A', 9, AF4)

/* I2C2_TXFRAME */
#define I2C2_TXFRAME_PA10 \
	GD32_PINMUX_AF('A', 10, AF4)

/* I2S1_ADD_SD */
#define I2S1_ADD_SD_PB14 \
	GD32_PINMUX_AF('B', 14, AF6)
#define I2S1_ADD_SD_PC2 \
	GD32_PINMUX_AF('C', 2, AF6)

/* I2S1_CK */
#define I2S1_CK_PA9 \
	GD32_PINMUX_AF('A', 9, AF5)
#define I2S1_CK_PB10 \
	GD32_PINMUX_AF('B', 10, AF5)
#define I2S1_CK_PB13 \
	GD32_PINMUX_AF('B', 13, AF5)
#define I2S1_CK_PC7 \
	GD32_PINMUX_AF('C', 7, AF5)

/* I2S1_MCK */
#define I2S1_MCK_PA3 \
	GD32_PINMUX_AF('A', 3, AF5)
#define I2S1_MCK_PA6 \
	GD32_PINMUX_AF('A', 6, AF6)
#define I2S1_MCK_PC6 \
	GD32_PINMUX_AF('C', 6, AF5)

/* I2S1_SD */
#define I2S1_SD_PB15 \
	GD32_PINMUX_AF('B', 15, AF5)
#define I2S1_SD_PC1 \
	GD32_PINMUX_AF('C', 1, AF7)
#define I2S1_SD_PC3 \
	GD32_PINMUX_AF('C', 3, AF5)

/* I2S1_WS */
#define I2S1_WS_PB9 \
	GD32_PINMUX_AF('B', 9, AF5)
#define I2S1_WS_PB12 \
	GD32_PINMUX_AF('B', 12, AF5)

/* I2S2_ADD_SD */
#define I2S2_ADD_SD_PB4 \
	GD32_PINMUX_AF('B', 4, AF7)
#define I2S2_ADD_SD_PC11 \
	GD32_PINMUX_AF('C', 11, AF5)

/* I2S2_CK */
#define I2S2_CK_PB3 \
	GD32_PINMUX_AF('B', 3, AF6)
#define I2S2_CK_PC10 \
	GD32_PINMUX_AF('C', 10, AF6)

/* I2S2_MCK */
#define I2S2_MCK_PB10 \
	GD32_PINMUX_AF('B', 10, AF6)
#define I2S2_MCK_PC7 \
	GD32_PINMUX_AF('C', 7, AF6)

/* I2S2_SD */
#define I2S2_SD_PB0 \
	GD32_PINMUX_AF('B', 0, AF7)
#define I2S2_SD_PB2 \
	GD32_PINMUX_AF('B', 2, AF7)
#define I2S2_SD_PB5 \
	GD32_PINMUX_AF('B', 5, AF6)
#define I2S2_SD_PC1 \
	GD32_PINMUX_AF('C', 1, AF5)
#define I2S2_SD_PC12 \
	GD32_PINMUX_AF('C', 12, AF6)

